game_consoles_backend/app/controllers/consoles_controller.rb

  def index
    consoles = Console.all
---
SELECT "consoles".* FROM "consoles"