game_consoles_backend/app/controllers/videogames_controller.rb

  def destroy
    videogame = Videogame.find_by(id: params[:id])
    videogame.destroy
---
SELECT "videogames".* FROM "videogames" WHERE "videogames"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "videogames" WHERE "videogames"."id" = ?  [["id", 3]]