game_consoles_backend/app/controllers/videogames_controller.rb

SELECT "videogames".* FROM "videogames" WHERE "videogames"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    videogame = Videogame.find(params[:id])

SELECT "videogames".* FROM "videogames"
---
  def index
    videogames = Videogame.all

SELECT "consoles".* FROM "consoles" WHERE "consoles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "videogames" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Tetris"], ["created_at", "2020-04-15 02:19:36.874110"], ["updated_at", "2020-04-15 02:19:36.874110"]]
INSERT INTO "videogames" ("title", "created_at", "updated_at", "console_id") VALUES (?, ?, ?, ?)  [["title", "gd"], ["created_at", "2020-04-17 22:20:11.811256"], ["updated_at", "2020-04-17 22:20:11.811256"], ["console_id", 7]]
---
  def create
    console = Console.find_by(id: params[:console_id])
    # videogame = Videogame.create(title: params[:title])
    videogame = Videogame.create(title: params[:videogame], console: params[:console_name])
    if videogame.save